text_list = ['人', 'に', '言う', 'べき', '事', 'は', '、', '最後', 'まで', 'きちんと', '言う', 'が', 'よい', '。', '全部', 'は', '言い', 'たく', 'ない', 'こと', 'だっ', 'たら', '、', 'むしろ', '初め', 'から', '黙っ', 'て', 'い', 'よ', '。']

text_new = ''.join(text_list)
print(text_new)

text_list = ['人', 'に', '言う', 'べき', '事', 'は', '、', '最後', 'まで', 'きちんと', '言う', 'が', 'よい', '。', '全部', 'は', '言い', 'たく', 'ない', 'こと', 'だっ', 'たら', '、', 'むしろ', '初め', 'から', '黙っ', 'て', 'い', 'よ', '。']

text_new = '-'.join(text_list)
print(text_new)

text_list = ['test', 1, 1.5]

text_new = '-'.join(str(x) for x in text_list)
print(text_new)